<template>
  <div class="container">
    <Header />
    <AllService />
    <Services :serviceContent="serviceContentSmm"/>
    <Services :serviceContent="serviceContentTarget"/>
    <Services :serviceContent="serviceContentBrand"/>
    <Services :serviceContent="serviceContentDevelopment"/>
    <Services :serviceContent="thisCases"/>
    <div class="divider" />
    <CaseCard />
    <div class="divider" />
    <CaseCard />
    <Feedback />
    <Slider />
    <Prices />
    <AccordionContainer />
    <Form />
    <Footer />
  </div>
</template>

<script lang="ts">
import Vue from 'vue'

import Prices from '~/components/Prices.vue'
import Accordion from '~/components/Accordion.vue'
import Feedback from '~/components/Feedback.vue'
import Services from '~/components/Services.vue'
import AccordionContainer from '~/components/AccordionContainer.vue'
export default Vue.extend({
	components: { Services, Feedback, Accordion, Prices, AccordionContainer },
  data() {
    return {
      serviceContentSmm: {
        "background": 'black',
        "title": "SMM Social media marketing",
        "topText": "С помощью хорошего соушиал медиа маркетинга можно:",
        "botText": "Давайте сотрудничать? Мы знаем, что такое хороший SMM :)",
        "list": [
          'Сделать бизнес с человеческим лицом. Это важно, потому что клиенты выбирают бренды, которые разделяют их ценности.',
          'Найти холодную аудиторию, вовлечь её в воронку и прогреть до целевого действия, не выходя за пределы соцсети.', 
          'Начать продавать в интернете или увеличить продажи в разы, если они уже есть.',
          'Грамотно управлять имиджем бренда и качественно общаться с аудиторией.',
          'Улучшить узнаваемость компании и повысить лояльность потенциальных клиентов.',
          ],
        "buttonsContent": [
          {
          'color': 'white',
          'text': 'Давайте!' 
          },
          {
          'color': 'black',
          'text': 'А сколько это стоит?' 
          }
        ],
      },
      serviceContentTarget: {
        "background": 'white',
        "title": "Таргетинг",
        "topText": "Таргетированная реклама помогает создать спрос там, где его не было раньше, найти новую аудиторию и получить клиентов.",
        "botText": "Выбирайте надёжные и прозрачные способы продвижения, а мы поможем!",
        "subtitleList": 'Это работает, потому что:',
        "list": [
          'Рекламу видит только ЦА, заинтересованная в вашем предложении.',
          'Аудитория сегментируется, а предложения персонализируются: один и тот же условный рис можно продать как ЗОЖный продукт обеспеченным женщинам, следящим за фигурой, так и как дешевую и сытную крупу, подходящую и на завтрак, и на обед, и на ужин — студентам :)', 
          'Гипотезы легко проверять, а объявления — корректировать, опираясь на отклик аудитории.',
          ],
        "buttonsContent": [
          {
          'color': 'black',
          'text': 'Хочу таргет' 
          },
          {
          'color': 'white',
          'text': 'А сколько это стоит?' 
          }
        ],
      },
      serviceContentBrand: {
        "background": 'black',
        "title": "Брендинг",
        "subtitle": 'Ваш бренд — это не просто логотип или фирменный стиль. Бренд — это образ в голове аудитории. Бренд есть у всего: от безымянной булочной за углом до банка «Тинькофф».',
        "description": "Если брендинг не сделать вовремя, в будущем будет сложнее повлиять на восприятие компании. Так, к примеру, у «Почты России» уже сформировался бренд: медленное обслуживание, очереди, неприветливые сотрудники и килька на полках. Сегодня Почта России поменялась: очередей на самом деле стало меньше, а большинство операций можно сделать онлайн, но представление осталось. Это и есть бренд.",
        "topText": "Чтобы люди не успели сделать выводы сами, начните работатьс брендом уже сейчас.",
        "botText": "Работайте над брендом, чтобы он работал на вас: когда бренд знаком и близок, покупают охотнее. Готовы начать?",
        "subtitleList": 'А мы поможем:',
        "list": [
          'Проанализируем рынок и вашу компанию, продукт или стартап. Изучим как положительный, так и негативный опыт конкурентов.',
          'Разработаем стратегию позиционирования, а на её основе выведем код бренда: визуальный и семантический.',
          'Сформулируем УТП, отобразим ценности и преимущества.',
          'Предложим названия продуктов.',
          'Разработаем дизайн логотипа и фирменный стиль.',
          'Расскажем о правилах использования фирстиля в гайдлайне: с помощью него вы сможете сделать брендированную продукцию правильно.',
          'Разработаем брендбук — подробный документ, включающий все возможности и правила работы с брендом.',
          ],
        "buttonsContent": [
          {
          'color': 'white',
          'text': 'Готов!' 
          },
          {
          'color': 'black',
          'text': 'А сколько это стоит?' 
          }
        ],
      },
      serviceContentDevelopment: {
        "background": 'white',
        "title": "Web-разработка",
        "topText": "Делаем сайты, чтобы вашим клиентам было удобно, а вам — полезно. Хороший сайт может:",
        "botText": "Нужен сайт? Нажмите на кнопку ниже, и процесс запустится :)",
        "list": [
          'Круто упаковать продукт и самостоятельно прогреть холодного клиента до целевого действия.',
          'Качественно взаимодействовать с аудиторией вместо вас.',
          'Поддерживать имидж бренда.',
          'Просто делать своё дело — продавать продукты, собирать заявки, быть визиткой, блогом или корпоративным порталом.',
          ],
        "buttonsContent": [
          {
          'color': 'black',
          'text': 'Хочу сайт' 
          },
          {
          'color': 'white',
          'text': 'А сколько это стоит?' 
          }
        ],
      },
      thisCases: {
        "background": 'pink',
        "topText": "Это кейсы!",
        "whiteBorder": true,
        "bigTopText": true,
        "leftUnderText": "Это всё потому что раньше мы занимались только SMM, а потом поняли, что упаковывать продукты с помощью сайтов круто, нашли хорошего разработчика и добавили эту услугу тоже.",
        "rightUnderText": "В связи с этим у нас есть взаимовыгодное предложение, ищите его внутри кнопки «Сколько стоит?» в разделе веб-разработки :)",
        "list": [
          'Мы сделали это вместе, а теперь показываем вам.',
          'Вы, наверное, заметили, что кейсов по веб-разработке маловато?',
          ],
      }
      
    }
  }
  
  })
  
</script>

<style lang="stylus">
.container
  margin 0 auto
  // min-height 100vh

.divider 
  height 20px
  position relative
  &:after
    content ''
    position absolute 
    background #F3F3F3
    top 50%
    transform translateY(-100%)
    width 100%
    height 1px

</style>
